app/controllers/accounts_controller.rb

    def create
        create_account = CreateAccount.new(account_params)
        if create_account.save
---
INSERT INTO "accounts" ("subdomain", "business_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["subdomain", "syook-pro"], ["business_name", "SyookPro"], ["created_at", "2017-11-15 06:05:12.700585"], ["updated_at", "2017-11-15 06:05:12.700585"]]