app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password", "username", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "aniket@syook.com"], ["password", "abcd1234"], ["username", "aniket-syook"], ["account_id", 1], ["created_at", "2017-11-15 06:16:26.615792"], ["updated_at", "2017-11-15 06:16:26.615792"]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "aniket@syook.com"]]
---
    def login
        @user = User.find_by_email(user_params.dig(:email))